Repository: microsoft/fsi-experiences
Catalog: Modules/RetailBankingDataModel/FSIFinancialServicesCommonDataModel/WebResources/msfsi_PluginResources/InfraLabels.*.resx
Languages: de_de, es_es, fr_fr, it_it, nl_nl, pt_br, zh_tw

# InputParameterIsNotAnEntity
source: InputParameters {0} is not an Entity.
de_de: InputParameters {0} ist keine Entität.
es_es: InputParameters {0} no es una entidad.
fr_fr: InputParameters {0} n’est pas une entité.
it_it: InputParameters {0} non è un'entità.
nl_nl: Invoerparameters {0} is geen entiteit.
pt_br: InputParameters {0} não é uma Entidade.
zh_tw: InputParameters {0} 不是實體。

# InputParameterIsNotOfCorrectType
source: InputParameters {0} is not of type {1} entity.
de_de: InputParameters {0} ist keine Entität des Typs {1}.
es_es: InputParameters {0} no es una entidad de tipo {1}.
fr_fr: InputParameters {0} n’est pas une entité de type {1}.
it_it: InputParameters {0} non è un tipo di entità {1}.
nl_nl: Invoerparameters {0} is geen entiteit van het type {1}.
pt_br: InputParameters {0} não é uma entidade do tipo {1}.
zh_tw: InputParameters {0} 不是 {1} 類型的實體。

# NullPreviousEntityState
source: Expected pre-entity image step registration for {0} entity by preImageAlias name: {1}. Operation = {2}
de_de: Erwartete Prä-Entitätsimage-Schritt-Registrierung für {0} Entität nach preImageAlias-Name: {1} . Vorgang = {2}
es_es: Registro esperado del paso de imagen previo a la entidad para {0} entidad por nombre preImageAlias: {1}. Operación = {2}
fr_fr: Enregistrement de l’étape d’image pré-entité attendu pour {0} entité par nom preImageAlias : {1}. Opération = {2}
it_it: Registrazione passaggio immagine pre-entità prevista per entità {0} per nome preImageAlias: {1}. Operazione = {2}
nl_nl: Verwachte registratie van de afbeeldingsstap voor entiteit {0} op preImageAlias-naam: {1}. Bewerking = {2}
pt_br: Registro de etapa de imagem pré-entidade esperado para a entidade {0} por nome de preImageAlias: {1}. Operação = {2}
zh_tw: 預期的 {0} 預先註冊實體影像步驟 依據 preImageAlias 名稱排列的實體: {1}. 作業 = {2}

# PrimaryEntityIdNotValue
source: Malformed Request for operation {0} PrimaryEntityId must be a valid, non empty Guid.
de_de: Falsch formatierte Anforderung für den Vorgang {0} PrimaryEntityId muss eine gültige, nicht leere GUID sein.
es_es: La solicitud de operación con formato incorrecto {0} PrimaryEntityId debe ser un Guid válido y no vacío.
fr_fr: Demande incorrecte pour l’opération {0} : PrimaryEntityId doit être un GUID valide et non vide.
it_it: Richiesta di operazione {0} non valida PrimaryEntityId deve essere un GUID valido non vuoto.
nl_nl: Ongeldige aanvraag voor bewerking {0} PrimaryEntityId moet een geldige, niet-lege GUID zijn.
pt_br: A Solicitação Malformada para a operação {0} PrimaryEntityId deve ser um Guid válido, não vazio.
zh_tw: 作業 {0} PrimaryEntityId 的要求格式錯誤，必須為有效的非空白 GUID。

# MissingInputParams
source: Malformed Request for operation {0}: {1} is missing in the InputParameters.
de_de: Falsch formatierte Anforderung für den Vorgang {0}: {1} fehlt in den InputParameters.
es_es: Solicitud de operación con formato incorrecto {0}: {1} en InputParameters.
fr_fr: Demande incorrecte pour l’opération {0} : {1} est manquant dans InputParameters.
it_it: Richiesta per l'operazione {0} non valida: {1} mancante in InputParameters.
nl_nl: Ongeldige aanvraag voor bewerking {0}: {1} ontbreekt in de invoerparameters.
pt_br: Solicitação Malformada para a operação {0}: {1} está ausente nos InputParameters.
zh_tw: 作業 {0} 的要求格式錯誤: InputParameters 中缺少 {1}。

# RetrieveMultipleMalformedInputParameter
source: Malformed Request for operation {0}: InputParameters {1} is not of type QueryExpression or FetchExpression.
de_de: Falsch formatierte Anforderung für den Vorgang {0}: InputParameters {1} sind nicht vom Typ QueryExpression oder FetchExpression.
es_es: Solicitud de operación con formato incorrecto {0}: InputParameters {1} no es del tipo QueryExpression ni FetchExpression.
fr_fr: Demande incorrecte pour l’opération {0} : InputParameters {1} n’est pas de type QueryExpression ou FetchExpression.
it_it: Richiesta per l'operazione {0} non valida: InputParameters {1} non è di tipo QueryExpression o FetchExpression.
nl_nl: Ongeldige aanvraag voor bewerking {0}: InputParameters {1} is niet van het type QueryExpression of FetchExpression.
pt_br: Solicitação Malformada para a operação {0}: InputParameters {1} não é do tipo QueryExpression ou FetchExpression.
zh_tw: 作業 {0} 的要求格式錯誤: InputParameters {1} 的類型不是 QueryExpression 或 FetchExpression。

# PreviousStateManagerNullPreImage
source: preImageAliasName cannot be null or empty.
de_de: preImageAliasName darf nicht NULL oder leer sein.
es_es: preImageAliasName no puede ser nulo ni estar vacío.
fr_fr: preImageAliasName ne peut pas avoir la valeur Null ou être vide.
it_it: preImageAliasName non può essere Null o vuoto.
nl_nl: preImageAliasName mag niet null of leeg zijn.
pt_br: preImageAliasName não pode ser nulo nem estar em branco.
zh_tw: preImageAliasName 不得為 Null 或空白。

# PreviousStateManagerStateNotAvailable
source: Failed to get previous state for PreImage entity alias {0}.
de_de: Vorheriger Status für PreImage-Entitäts-Alias {0} kann nicht abgerufen werden.
es_es: Error al obtener el estado anterior del alias de entidad PreImage {0}.
fr_fr: Impossible d’obtenir l’état précédent de l’alias d’entité PreImage {0}.
it_it: Impossibile ottenere lo stato precedente per l'alias entità PreImage {0}.
nl_nl: Kan vorige status voor alias voor PreImage-entiteit {0} niet ophalen.
pt_br: Falha ao obter o estado anterior para o alias da entidade PreImage {0}.
zh_tw: 無法取得 PreImage 實體別名 {0} 先前的狀態。

# PreviousStateManagerStateForEntityNotAvailable
source: Failed to get previous state for {0} entity.
de_de: Vorheriger Status für die Entität {0} kann nicht abgerufen werden.
es_es: Error al obtener el estado anterior de la entidad {0}.
fr_fr: Impossible d’obtenir l’état précédent de l’entité {0}.
it_it: Impossibile ottenere lo stato precedente per l'entità {0}.
nl_nl: Kan vorige status voor entiteit {0} niet ophalen.
pt_br: Falha ao obter o estado anterior para a entidade {0}.
zh_tw: 無法取得 {0} 實體先前的狀態。

# ContactQueryIdNullOrEmpty
source: ContactId query parameter is null or empty.
de_de: Der ContactId-Abfrageparameter ist NULL oder leer.
es_es: El parámetro de consulta ContactId es nulo o está vacío.
fr_fr: Le paramètre de requête ContactId a la valeur Null ou est vide.
it_it: Il parametro di query ContactId è Null o vuoto.
nl_nl: ContactId-queryparameter is null of leeg.
pt_br: O parâmetro de consulta ContactId é nulo ou está vazio.
zh_tw: ContactId 查詢參數為 Null 或空白。

# MissingMappingDataInCi
source: Missing mapping data between Ci Customer id to Contact Id.
de_de: Fehlende Zuordnungsdaten zwischen CI-Kunden-ID und Kontakt-ID.
es_es: Faltan datos de asignación entre el Id. de cliente Ci y el Id. de contacto.
fr_fr: Données de mappage manquantes entre l’ID de client CI et l’ID de contact.
it_it: Dati del mapping mancanti tra l'ID cliente CI e l'ID contatto.
nl_nl: Ontbrekende toewijzingsgegevens tussen id van CI-klant en contactpersoon-id.
pt_br: Dados de mapeamento ausentes entre a ID do Cliente CI para a ID do Contato.
zh_tw: 缺少 CI 客戶識別碼和連絡人識別碼之間的對應資料。

# EntityDoesNotExist
source: Entity {0} does not exist.
de_de: Die Entität „{0}“ ist nicht vorhanden.
es_es: La entidad {0} no existe.
fr_fr: L’entité {0} n’existe pas.
it_it: L'entità {0} non esiste.
nl_nl: Entiteit {0} bestaat niet.
pt_br: A entidade {0} não existe.
zh_tw: 實體 {0} 不存在。

# RetrieveMultipleFailed
source: Failed to RetrieveMultiple from {0} entity: {1}.
de_de: Abrufen mehrerer Elemente aus Entität {0} fehlgeschlagen: {1}.
es_es: No se ha podido realizar una recuperación múltiple desde la entidad {0}: {1}.
fr_fr: Impossible d’exécuter Récupérer multiple à partir de l’entité {0} : {1}.
it_it: Impossibile recuperare più elementi dall'entità {0}: {1}
nl_nl: RetrieveMultiple kan niet worden opgehaald uit entiteit {0}: {1}.
pt_br: Falha ao recuperar vários resultados da entidade {0}: {1}.
zh_tw: 無法從 {0} 實體取出倍數: {1}。

# RetrieveMultipleQueryFailed
source: Failed to retrieve multiple results while attempting to query {0}. ExceptionMessage = {1}.
de_de: Fehler beim Abrufen mehrerer Ergebnisse beim Versuch einer Abfrage von {0}. ExceptionMessage = {1}.
es_es: Error al recuperar varios resultados al intentar consultar {0}. ExceptionMessage = {1}.
fr_fr: Impossible d’extraire plusieurs résultats lors de la tentative d’interrogation de {0}. ExceptionMessage = {1}.
it_it: Impossibile recuperare più risultati durante il tentativo di eseguire query su {0}. ExceptionMessage = {1}.
nl_nl: Ophalen van meerdere resultaten is mislukt bij poging om query {0} uit te voeren. ExceptionMessage = {1}.
pt_br: Falha ao recuperar vários resultados ao tentar consultar {0}. ExceptionMessage = {1}.
zh_tw: 嘗試查詢 {0} 時無法取得多個結果。ExceptionMessage = {1}。

# MissingConfigurationInChurnConfig
source: Missing configurations in {0} entity.
de_de: Fehlende Konfigurationen in Entität {0}.
es_es: Faltan configuraciones en la entidad {0}.
fr_fr: Configurations manquantes dans l’entité {0}.
it_it: Configurazioni mancanti nell'entità {0}.
nl_nl: Ontbrekende configuraties in entiteit {0}.
pt_br: Configurações ausentes na entidade {0}.
zh_tw: {0} 實體中缺少設定。

# ParsingFailedForChurnLevel
source: Failed to parse Churn Level config value to float. value = {0}. Exception message: {1}. Table data is corrupt.
de_de: Fehler beim Analysieren des Konfigurationswerts der Abwanderungsebene in Float. Wert = {0} . Ausnahmenachricht: {1} . Die Tabellendaten sind beschädigt.
es_es: Error al analizar el valor de configuración de nivel de abandono para float. valor = {0}. Mensaje de excepción: {1}. Los datos de la tabla están dañados.
fr_fr: Impossible d’analyser la valeur de configuration du niveau d’abandon dans Float. valeur = {0}. Message d’exception : {1}. Les données de la table sont corrompues.
it_it: Impossibile analizzare valore di configurazione livello di abbandono a float. valore = {0}. Messaggio di eccezione: {1}. I dati della tabella sono corrotti.
nl_nl: Parseren van configuratiewaarde van Verloopniveau naar zwevende indeling mislukt. waarde = {0}. Uitzonderingsbericht: {1}. Tabelgegevens zijn beschadigd.
pt_br: Falha ao analisar o valor de configuração de Nível de Rotatividade como float. valor = {0}. Mensagem de exceção: {1}. Os dados da tabela estão corrompidos.
zh_tw: 無法將流失等級設定值剖析為浮點數。 值 = {0}。例外狀況訊息: {1}。 資料表資料已毀損。

# InitializationOfEntityFailed
source: Failed to initialize / query the entity.
de_de: Fehler bei der Initialisierung/Abfrage der Entität.
es_es: No se pudo inicializar/consultar la entidad.
fr_fr: Impossible d’initialiser ou d’interroger l’entité.
it_it: Impossibile inizializzare/eseguire query per l'entità.
nl_nl: Het initialiseren/uitvoeren van een query op de entiteit is mislukt.
pt_br: Falha ao inicializar/consultar a entidade.
zh_tw: 無法初始化/查詢實體。

# GroupTypeIsEmpty
source: Type of Group {0} is empty.
de_de: Der Gruppentyp {0} ist leer.
es_es: El tipo de grupo {0} está vacío.
fr_fr: Le type de groupe {0} est vide.
it_it: Il tipo di gruppo {0} è vuoto.
nl_nl: Type van groep {0} is leeg.
pt_br: O Tipo de Grupo {0} está vazio.
zh_tw: 群組 {0} 類型為空白。

# TableDoesNotExist
source: Table {0} does not exist.
de_de: Die Tabelle {0} ist nicht vorhanden.
es_es: La tabla {0} no existe.
fr_fr: La table {0} n’existe pas.
it_it: La tabella {0} non esiste.
nl_nl: Tabel {0} bestaat niet.
pt_br: A tabela {0} não existe.
zh_tw: 資料表 {0} 不存在。

# CiDataSourceAcquireFailed
source: Acquired CI Datasource Name from {0} cannot be null or empty.
de_de: Von {0} erworbener Name der CI-Datenquelle darf nicht NULL oder leer sein.
es_es: El nombre del origen de datos CE adquirido {0} no puede ser nulo ni estar vacío.
fr_fr: Le nom de la source de données CI acquise de {0} ne peut pas avoir la valeur Null ou être vide.
it_it: Il nome origine dati CI acquisito da {0} non può essere Null o vuoto.
nl_nl: Naam van verworven CI-gegevensbron van {0} mag niet null of leeg zijn.
pt_br: O Nome da Fonte de Dados CI adquirido de {0} não pode ser nulo nem estar vazio.
zh_tw: {0} 的收購 CI 資料來源名稱不可以是 Null 或空白。

# CiEntityNameNullOrEmpty
source: CI Entity Name from {0} cannot be null or empty.
de_de: Von {0} erworbener Name der CI-Entität darf nicht NULL oder leer sein.
es_es: El nombre de la entidad CI adquirida {0} no puede ser nulo ni estar vacío.
fr_fr: Le nom de l’entité CI de {0} ne peut pas avoir la valeur Null ou être vide.
it_it: Il nome entità CI da {0} non può essere Null o vuoto.
nl_nl: Naam van CI-entiteit van {0} mag niet null of leeg zijn.
pt_br: O Nome da Entidade CI de {0} não pode ser nulo nem estar vazio.
zh_tw: {0} 的 CI 實體名稱不可以是 Null 或空白。

# UnexpectedError
source: An unexpected error occurred.
de_de: Unerwarteter Fehler.
es_es: Error inesperado.
fr_fr: Une erreur inattendue s’est produite.
it_it: Si è verificato un errore imprevisto.
nl_nl: Er is een onverwachte fout opgetreden.
pt_br: Erro inesperado.
zh_tw: 發生未預期的錯誤。

# InputParametersNeitherQueryNorFetch
source: Input parameters are neither QueryExpression nor FetchExpression.
de_de: Eingabeparameter sind weder QueryExpression noch FetchExpression.
es_es: Los parámetros de entrada no son QueryExpression ni FetchExpression.
fr_fr: Les paramètres d’entrée ne sont ni QueryExpression ni FetchExpression.
it_it: I parametri di input non sono QueryExpression o FetchExpression.
nl_nl: Invoerparameters zijn geen QueryExpression of FetchExpression.
pt_br: Os parâmetros de entrada não são QueryExpression nem FetchExpression.
zh_tw: 輸入參數不是 QueryExpression 也不是 FetchExpression。

# FailedToConvertQuery
source: Failed to convert FetchExpression to QueryExpression: {0}.
de_de: Fehler beim Konvertieren von FetchExpression in QueryExpression: {0}.
es_es: Error al convertir FetchExpression en QueryExpression: {0}.
fr_fr: Échec de la conversion de FetchExpression en QueryExpression : {0}.
it_it: Impossibile convertire FetchExpression in QueryExpression: {0}.
nl_nl: Kan FetchExpression niet converteren naar QueryExpression: {0}.
pt_br: Falha ao converter FetchExpression em QueryExpression: {0}.
zh_tw: 無法將 FetchExpression 轉換為 QueryExpression: {0}。

# CiCustomerIdWasNotFound
source: Could not find CI customer id for contact id {0}.
de_de: Die CI-Kunden-ID für die Kontakt-ID {0} wurde nicht gefunden.
es_es: No se pudo encontrar el id. de cliente CI para el identificador de contacto {0}.
fr_fr: ID client CI pour l’ID de contact {0} introuvable.
it_it: Impossibile trovare l'ID cliente CI per l'ID contatto {0}.
nl_nl: Kan geen CI-klant-id vinden voor contactpersoon-id {0}.
pt_br: Não foi possível encontrar a ID do cliente CI para a ID do contato {0}.
zh_tw: 找不到連絡人識別碼 {0} 的 CI 客戶識別碼。

# ParameterCantBeNullOrEmpty
source: Parameter {0} cannot be null or empty.
de_de: Der Parameter {0} darf nicht Null oder leer sein.
es_es: El parámetro {0} no puede ser nulo ni estar vacío.
fr_fr: Le paramètre {0} ne peut pas être null ou vide.
it_it: Il parametro {0} non può essere Null o vuoto.
nl_nl: Parameter {0} mag niet null of leeg zijn.
pt_br: O parâmetro {0} não pode ser nulo nem estar vazio.
zh_tw: 參數 {0} 不能為 Null 或空白。

# GuidCantBeNullOrEmpty
source: Guid parameter cannot be null or empty.
de_de: Der GUID-Parameter darf nicht Null oder leer sein.
es_es: El parámetro Guid no puede ser nulo ni estar vacío.
fr_fr: Le paramètre Guid ne peut pas être null ou vide.
it_it: Il parametro GUID non può essere Null o vuoto.
nl_nl: Guid-parameter mag niet null of leeg zijn.
pt_br: O parâmetro Guid não pode ser nulo nem estar vazio.
zh_tw: GUID 參數不能為 Null 或空白。

# WrongOperation
source: Expected {0} operation for this plugin.
de_de: Es wurde der Vorgang {0} für dieses Plug-In erwartet.
es_es: Funcionamiento {0} esperado para este complemento.
fr_fr: Opération {0} attendue pour ce plug-in.
it_it: Operazione {0} prevista per questo plug-in.
nl_nl: Bewerking {0} werd verwacht voor deze invoegtoepassing.
pt_br: Operação {0} esperada para este plug-in.
zh_tw: 此外掛程式預期的 {0} 作業。
