Repository: microsoft/fsi-experiences
Catalog: Modules/UnifiedCustomerProfile/FSIRetailBankingCoreComponents/WebResources/msfsi_PluginResources/RetailBankingComponentsLabels.*.resx
Languages: de_de, it_it, nl_nl, zh_tw

# GroupRetrieveCreationDateFailed
source: Retrieval of creation date failed for group {0}.
de_de: Fehler beim Abrufen des Erstellungsdatums für die Gruppe {0}.
it_it: Recupero della data di creazione non riuscito per il gruppo {0}.
nl_nl: Ophalen van aanmaakdatum mislukt voor groep {0}.
zh_tw: 群組 {0} 的建立時間擷取失敗。

# InputDataJsonFormatError
source: The input data was not in the correct json format.
de_de: Die eingegebenen Daten hatten nicht das richtige JSON-Format.
it_it: I dati di input non sono nel formato json corretto.
nl_nl: De invoergegevens hebben niet de juiste JSON-indeling.
zh_tw: 輸入資料的 json 格式不正確。

# InvalidInputParameter
source: Malformed Request: {0} is missing in the InputParameters.
de_de: Falsch formatierte Anforderung: {0} fehlt in den InputParameters.
it_it: Richiesta non valida: {0} mancante in InputParameters.
nl_nl: Ongeldige aanvraag: {0} ontbreekt in de InputParameters.
zh_tw: 要求格式錯誤: InputParameters 中缺少 {0}。

# GroupEntityDataNotFound
source: Entity data was not found.
de_de: Die Entitätsdaten wurden nicht gefunden.
it_it: Impossibile trovare i dati entità.
nl_nl: Entiteitsgegevens niet gevonden.
zh_tw: 找不到實體資料。

# GroupCountGroupsCantBeRetrieved
source: There was an issue retrieving the count of groups customer {0} belongs to.
de_de: Beim Abrufen der Anzahl der Gruppen, zu denen der Kunde {0} gehört, ist ein Problem aufgetreten.
it_it: Si è verificato un problema durante il recupero del conteggio di gruppi a cui appartiene il cliente {0}.
nl_nl: Er was een probleem bij het ophalen van het aantal groepen waartoe klant {0} behoort.
zh_tw: 擷取客戶 {0} 所屬的群組計數時發生問題。

# GroupCountGroupsCantBeReturned
source: There was an issue returning the count of groups customer {0} belongs to.
de_de: Beim Zurückgeben der Anzahl der Gruppen, zu denen der Kunde {0} gehört, ist ein Problem aufgetreten.
it_it: Si è verificato un problema durante la restituzione del conteggio di gruppi a cui appartiene il cliente {0}.
nl_nl: Er was een probleem bij het retourneren van het aantal groepen waartoe klant {0} behoort.
zh_tw: 傳回客戶 {0} 所屬的群組計數時發生問題。

# GroupCountGroupsCantBeConverted
source: There was an issue converting the count of groups customer {0} belongs to - entity count was supposed to be a number.
de_de: Beim Konvertieren der Anzahl der Gruppen, zu denen der Kunde {0} gehört, ist ein Problem aufgetreten - Die Anzahl der Entitäten muss ein Zahl sein.
it_it: Si è verificato un problema durante la conversione del conteggio di gruppi a cui appartiene il cliente {0}: il conteggio di entità deve essere un numero.
nl_nl: Er was een probleem bij het converteren van het aantal groepen waartoe klant {0} behoort - aantal entiteiten moet een getal zijn.
zh_tw: 轉換客戶 {0} 所屬的群組計數時發生問題 - 實體計數應該是數字。

# GroupNoEntityInGetValue
source: No entity result found.
de_de: Kein Entitätsergebnis gefunden.
it_it: Nessun risultato di entità trovato.
nl_nl: Geen entiteitsresultaat gevonden.
zh_tw: 找不到任何實體結果。

# GroupNoAttributeNameInGetValue
source: {0} attribute was not found.
de_de: Das Attribut {0} wurde nicht gefunden.
it_it: Attributo {0} non trovato.
nl_nl: Kenmerk {0} is niet gevonden.
zh_tw: 找不到 {0} 屬性。

# GroupIncompatiableAttributeTypeInGetValue
source: {0} is not of type {1}.
de_de: {0} weist nicht den Typ {1} auf.
it_it: {0} non è di tipo {1}.
nl_nl: {0} is niet van het type {1}.
zh_tw: {0} 不屬於 {1} 類型。

# GroupIsNotInTheMostUpdatedState
source: Group {0} is not in the most updated state.
de_de: Die Gruppe {0} hat nicht den aktuellsten Status.
it_it: Il gruppo {0} non è nello stato più aggiornato.
nl_nl: Groep {0} heeft niet de meest bijgewerkte status.
zh_tw: 群組 {0} 不是最新狀態。

# GroupVersionRetrievalFailure
source: Group {0} version retrieval request problem.
de_de: Problem bei der Anforderung zum Abrufen der Version der Gruppe {0}.
it_it: Problema di richiesta recupero versione per il gruppo {0}.
nl_nl: Probleem bij ophaalaanvraag voor versie van groep {0}.
zh_tw: 群組 {0} 版本擷取要求問題。

# GroupTransactionResultError
source: Something went wrong with the returned result of the requests.
de_de: Beim zurückgegebenen Ergebnis der Anforderungen ist ein Fehler aufgetreten.
it_it: Si è verificato un errore nel risultato restituito delle richieste.
nl_nl: Er is iets misgegaan met het geretourneerde resultaat van de aanvragen.
zh_tw: 傳回的要求結果發生錯誤。

# GroupTransactionResultEmpty
source: No responses found for the request.
de_de: Für die Anforderung wurden keine Antworten gefunden.
it_it: Nessuna risposta trovata per la richiesta.
nl_nl: Geen responsen gevonden voor de aanvraag.
zh_tw: 找不到要求的任何回覆。

# GroupTransactionResultEntityError
source: Entity didn't return successfully.
de_de: Die Entität wurde nicht erfolgreich zurückgegeben.
it_it: L'entità non è stata restituita correttamente.
nl_nl: Entiteit is niet geretourneerd.
zh_tw: 未成功返回實體。

# GroupNameNullOrEmpty
source: Group {0} name is null or empty.
de_de: Der Name der Gruppe {0} ist NULL oder leer.
it_it: Il nome del gruppo {0} è Null o vuoto.
nl_nl: Naam van groep {0} is null of leeg.
zh_tw: 群組 {0} 名稱為 Null 或空白。

# GroupMembersNullOrEmpty
source: Group {0} members collection is null.
de_de: Die Sammlung der Mitglieder der Gruppe {0} ist NULL.
it_it: La raccolta membri per il gruppo {0} è Null.
nl_nl: Verzameling van leden van groep {0} is null.
zh_tw: 群組 {0} 成員集合為 Null。

# GroupFinancialHoldingsNull
source: Group {0} financial holdings collection is null.
de_de: Die Sammlung der Finanzanlagen für Gruppe {0} ist NULL.
it_it: La raccolta partecipazioni finanziarie per il gruppo {0} è Null.
nl_nl: Verzameling financiële bezittingen voor groep {0} is null.
zh_tw: 群組 {0} 金融資產集合為 Null。

# GroupPrimaryMemberMissing
source: Group {0} is missing primary member field.
de_de: In der Gruppe {0} fehlt das Feld „Primäres Mitglied“.
it_it: Campo membro primario mancante per il gruppo {0}.
nl_nl: In groep {0} ontbreekt het veld voor primair lid.
zh_tw: 群組 {0} 缺少主要成員欄位。

# GroupFinancialHoldingsEmpty
source: Group {0} is missing financial holdings field.
de_de: Für die Gruppe {0} fehlt das Feld „Finanzanlage“.
it_it: Campo partecipazioni finanziarie mancante per il gruppo {0}.
nl_nl: Veld Financiële bezittingen ontbreekt voor groep {0}.
zh_tw: 群組 {0} 缺少金融資產欄位。

# FHFetchError
source: There was a problem building financial holdings collection.
de_de: Die Finanzanlagesammlung konnte nicht erstellt werden.
it_it: Si è verificato un problema durante la creazione della raccolta di partecipazioni finanziarie.
nl_nl: Er was een probleem bij het bouwen van de verzameling financiële bezittingen.
zh_tw: 建置金融資產集合時發生問題。
