Repository: microsoft/fsi-experiences
Catalog: Modules/UCP-Retail-Banking/FSIRetailBankingCoreComponents/WebResources/msfsi_PluginResources/RetailBankingComponentsLabels.*.resx
Languages: pt_br

# GroupRetrieveCreationDateFailed
source: Retrieval of creation date failed for group {0}.
pt_br: Falha na recuperação da data de criação do grupo {0}.

# InputDataJsonFormatError
source: The input data was not in the correct json format.
pt_br: Os dados de entrada não estão no formato json correto.

# InvalidInputParameter
source: Malformed Request: {0} is missing in the InputParameters.
pt_br: Solicitação Malformada: {0} está ausente nos InputParameters.

# GroupEntityDataNotFound
source: Entity data was not found.
pt_br: Dados de entidade não encontrados.

# GroupCountGroupsCantBeRetrieved
source: There was an issue retrieving the count of groups customer {0} belongs to.
pt_br: Problema ao recuperar a contagem de grupos aos quais o cliente {0} pertence.

# GroupCountGroupsCantBeReturned
source: There was an issue returning the count of groups customer {0} belongs to.
pt_br: Problema ao retornar a contagem de grupos aos quais o cliente {0} pertence.

# GroupCountGroupsCantBeConverted
source: There was an issue converting the count of groups customer {0} belongs to - entity count was supposed to be a number.
pt_br: Houve um problema na conversão da contagem de grupos aos quais o cliente {0} pertence – a contagem de entidades deveria ser um número.

# GroupNoEntityInGetValue
source: No entity result found.
pt_br: Nenhum resultado de entidade encontrado.

# GroupNoAttributeNameInGetValue
source: {0} attribute was not found.
pt_br: O atributo {0} não foi encontrado.

# GroupIncompatiableAttributeTypeInGetValue
source: {0} is not of type {1}.
pt_br: {0} não é do tipo {1}.

# GroupIsNotInTheMostUpdatedState
source: Group {0} is not in the most updated state.
pt_br: O grupo {0} não está no estado mais atualizado.

# GroupVersionRetrievalFailure
source: Group {0} version retrieval request problem.
pt_br: Problema na solicitação de recuperação de versão do grupo {0}.

# GroupTransactionResultError
source: Something went wrong with the returned result of the requests.
pt_br: Algo deu errado com o resultado retornado das solicitações.

# GroupTransactionResultEmpty
source: No responses found for the request.
pt_br: Nenhuma resposta encontrada para a solicitação.

# GroupTransactionResultEntityError
source: Entity didn't return successfully.
pt_br: A entidade não retornou com êxito.

# GroupNameNullOrEmpty
source: Group {0} name is null or empty.
pt_br: O nome do grupo {0} é nulo ou está vazio.

# GroupMembersNullOrEmpty
source: Group {0} members collection is null.
pt_br: A coleção de membros do grupo {0} é nula.

# GroupFinancialHoldingsNull
source: Group {0} financial holdings collection is null.
pt_br: A coleção de holdings financeiras do grupo {0} é nula.

# GroupPrimaryMemberMissing
source: Group {0} is missing primary member field.
pt_br: O campo de membro primário do grupo {0} está ausente.

# GroupFinancialHoldingsEmpty
source: Group {0} is missing financial holdings field.
pt_br: O campo de holdings financeiras está ausente do grupo {0}.

# FHFetchError
source: There was a problem building financial holdings collection.
pt_br: Houve um problema na criação da coleção de holdings financeiras.
